ceph/8hdd/cephfs_i01.log
4k_randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
4k_randread: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
64k_write: (g=2): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
64k_read: (g=3): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
fio-3.7
Starting 4 processes
4k_randwrite: Laying out IO file (1 file / 5120MiB)
4k_randread: Laying out IO file (1 file / 5120MiB)
64k_write: Laying out IO file (1 file / 5120MiB)
64k_read: Laying out IO file (1 file / 5120MiB)

4k_randwrite: (groupid=0, jobs=1): err= 0: pid=175074: Mon Aug 17 23:17:41 2020
  write: IOPS=386, BW=1548KiB/s (1585kB/s)(45.4MiB/30003msec)
    slat (usec): min=18, max=4256, avg=22.93, stdev=53.72
    clat (usec): min=1366, max=83195, avg=2557.40, stdev=897.93
     lat (usec): min=1385, max=83215, avg=2580.75, stdev=900.14
    clat percentiles (usec):
     |  1.00th=[ 2024],  5.00th=[ 2212], 10.00th=[ 2278], 20.00th=[ 2376],
     | 30.00th=[ 2442], 40.00th=[ 2474], 50.00th=[ 2540], 60.00th=[ 2573],
     | 70.00th=[ 2606], 80.00th=[ 2671], 90.00th=[ 2704], 95.00th=[ 2769],
     | 99.00th=[ 4047], 99.50th=[ 4490], 99.90th=[10159], 99.95th=[10552],
     | 99.99th=[20579]
   bw (  KiB/s): min=  979, max= 1442, per=75.34%, avg=1165.44, stdev=49.46, samples=59
   iops        : min=  244, max=  360, avg=290.95, stdev=12.35, samples=59
  lat (msec)   : 2=0.77%, 4=98.20%, 10=0.90%, 20=0.11%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.29%, sys=0.99%, ctx=11613, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,11611,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
4k_randread: (groupid=1, jobs=1): err= 0: pid=175076: Mon Aug 17 23:17:41 2020
   read: IOPS=125, BW=504KiB/s (516kB/s)(14.8MiB/30015msec)
    slat (usec): min=5, max=130, avg=28.36, stdev=11.16
    clat (usec): min=560, max=1458.9k, avg=7907.51, stdev=25389.48
     lat (usec): min=571, max=1458.9k, avg=7936.43, stdev=25389.88
    clat percentiles (usec):
     |  1.00th=[    889],  5.00th=[   1074], 10.00th=[   2278],
     | 20.00th=[   3294], 30.00th=[   4228], 40.00th=[   5211],
     | 50.00th=[   6259], 60.00th=[   7308], 70.00th=[   8225],
     | 80.00th=[   9241], 90.00th=[  10159], 95.00th=[  18482],
     | 99.00th=[  33817], 99.50th=[  84411], 99.90th=[ 125305],
     | 99.95th=[ 132645], 99.99th=[1451230]
   bw (  KiB/s): min=  128, max=  511, per=73.05%, avg=367.46, stdev=98.83, samples=57
   iops        : min=   32, max=  127, avg=91.53, stdev=24.70, samples=57
  lat (usec)   : 750=0.40%, 1000=2.75%
  lat (msec)   : 2=4.92%, 4=19.45%, 10=61.07%, 20=6.88%, 50=3.81%
  lat (msec)   : 100=0.32%, 250=0.37%
  cpu          : usr=0.17%, sys=0.41%, ctx=3780, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3779,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
64k_write: (groupid=2, jobs=1): err= 0: pid=175077: Mon Aug 17 23:17:41 2020
  write: IOPS=348, BW=21.8MiB/s (22.8MB/s)(654MiB/30002msec)
    slat (usec): min=14, max=5352, avg=25.02, stdev=52.34
    clat (usec): min=1713, max=18980, avg=2841.26, stdev=617.75
     lat (usec): min=1736, max=19010, avg=2866.69, stdev=621.42
    clat percentiles (usec):
     |  1.00th=[ 2180],  5.00th=[ 2409], 10.00th=[ 2507], 20.00th=[ 2606],
     | 30.00th=[ 2671], 40.00th=[ 2737], 50.00th=[ 2802], 60.00th=[ 2868],
     | 70.00th=[ 2900], 80.00th=[ 2966], 90.00th=[ 3064], 95.00th=[ 3163],
     | 99.00th=[ 4621], 99.50th=[ 5604], 99.90th=[11600], 99.95th=[13566],
     | 99.99th=[14877]
   bw (  KiB/s): min=19644, max=23708, per=96.20%, avg=21455.37, stdev=861.02, samples=59
   iops        : min=  306, max=  370, avg=334.68, stdev=13.52, samples=59
  lat (msec)   : 2=0.22%, 4=98.25%, 10=1.26%, 20=0.27%
  cpu          : usr=0.35%, sys=0.87%, ctx=10459, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,10456,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
64k_read: (groupid=3, jobs=1): err= 0: pid=175099: Mon Aug 17 23:17:41 2020
   read: IOPS=795, BW=49.7MiB/s (52.1MB/s)(1492MiB/30015msec)
    slat (nsec): min=6050, max=74054, avg=19597.38, stdev=4576.90
    clat (usec): min=565, max=287419, avg=1234.81, stdev=3381.23
     lat (usec): min=571, max=287459, avg=1254.79, stdev=3381.57
    clat percentiles (usec):
     |  1.00th=[   668],  5.00th=[   742], 10.00th=[   783], 20.00th=[   824],
     | 30.00th=[   865], 40.00th=[   906], 50.00th=[   955], 60.00th=[  1029],
     | 70.00th=[  1123], 80.00th=[  1205], 90.00th=[  1303], 95.00th=[  1385],
     | 99.00th=[  8356], 99.50th=[ 13566], 99.90th=[ 28705], 99.95th=[ 32113],
     | 99.99th=[198181]
   bw (  KiB/s): min= 1788, max=58112, per=100.00%, avg=50916.78, stdev=8401.06, samples=60
   iops        : min=   27, max=  908, avg=795.53, stdev=131.37, samples=60
  lat (usec)   : 750=6.11%, 1000=50.95%
  lat (msec)   : 2=40.69%, 4=0.28%, 10=1.23%, 20=0.45%, 50=0.27%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=0.58%, sys=1.79%, ctx=23873, majf=0, minf=25
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=23873,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1548KiB/s (1585kB/s), 1548KiB/s-1548KiB/s (1585kB/s-1585kB/s), io=45.4MiB (47.6MB), run=30003-30003msec

Run status group 1 (all jobs):
   READ: bw=504KiB/s (516kB/s), 504KiB/s-504KiB/s (516kB/s-516kB/s), io=14.8MiB (15.5MB), run=30015-30015msec

Run status group 2 (all jobs):
  WRITE: bw=21.8MiB/s (22.8MB/s), 21.8MiB/s-21.8MiB/s (22.8MB/s-22.8MB/s), io=654MiB (685MB), run=30002-30002msec

Run status group 3 (all jobs):
   READ: bw=49.7MiB/s (52.1MB/s), 49.7MiB/s-49.7MiB/s (52.1MB/s-52.1MB/s), io=1492MiB (1565MB), run=30015-30015msec